{ "posts": [{
    "author": "yelloyo1",
    "date": "March 24, 2017",
    "title": "Question about ancient breads",
    "content": "If I were to eat 3 loaves of bread, one from Egypt in the year 2200BC, one from Rome in the year 45BC, and one from England in the year 1100AD, how much different would each one be to the modern day and/or to each other?"
    }, {
    "author": "tachibanakanade",
    "date": "March 24, 2017",
    "title": "Why is scientology a religion?",
    "content": "Why was the Church of Scientology officially recognized as a religion in America, even though it committed numerous criminal acts including infiltration and espionage toward the Federal government? The Church of Scientology, or at least individuals acting in the name of it, committed a number of bad acts prior to being given recognition as a religion so why were they still rewarded? And why weren't they treated as a terrorist organiation?"
    }, {
    "author": "ArmandoAlvarezWF",
    "date": "March 24, 2017",
    "title": "Why did the Eastern bloq develop so many spatial puzzles still used today?",
    "content": "The Rubik's cube was invented in Hungary in 1974. Tetris was created in 1984 in Moscow. Was there something about Eastern bloc culture in that era that made spatial puzzles particularly appealing? Also how were they marketed in Communist countries and how were they popularized in the West?"
    }, {
    "author": "Syndweller",
    "date": "March 24, 2017",
    "title": "Why did the US not form an alliance with Napoleon when he was fighting the British c. 1812?",
    "content": "Would there have been strategic for both American and French benefit from such an alliance? Why was it not formed to fight their common foe?"
    }, {
    "author": "trampabroad",
    "date": "March 24, 2017",
    "title": "How accurate is Tyler Durden's speech on the origin of soap?",
    "content": "In the book(and movie) Tyler goes on an extended monologue about the origin of   soap in Indian burial pyres."
  }]
}
