{ "posts": [{
    "author": "yelloyo1",
    "date": "March 24, 2017",
    "title": "Question about ancient breads",
    "content": "If I were to eat 3 loaves of bread, one from Egypt in the year 2200BC, one from Rome in the year 45BC, and one from England in the year 1100AD, how much different would each one be to the modern day and/or to each other?"
    }, {
    "author": "tachibanakanade",
    "date": "March 24, 2017",
    "title": "Why is scientology a religion?",
    "content": "Why was the Church of Scientology officially recognized as a religion in America, even though it committed numerous criminal acts including infiltration and espionage toward the Federal government? The Church of Scientology, or at least individuals acting in the name of it, committed a number of bad acts prior to being given recognition as a religion so why were they still rewarded? And why weren't they treated as a terrorist organiation?"
    }, {
    "author": "ArmandoAlvarezWF",
    "date": "March 24, 2017",
    "title": "Why did the Eastern bloq develop so many spatial puzzles still used today?",
    "content": "The Rubik's cube was invented in Hungary in 1974. Tetris was created in 1984 in Moscow. Was there something about Eastern bloc culture in that era that made spatial puzzles particularly appealing? Also how were they marketed in Communist countries and how were they popularized in the West?"
    }, {
    "author": "Syndweller",
    "date": "March 24, 2017",
    "title": "Why did the US not form an alliance with Napoleon when he was fighting the British c. 1812?",
    "content": "Would there have been strategic for both American and French benefit from such an alliance? Why was it not formed to fight their common foe?"
    }, {
    "author": "trampabroad",
    "date": "March 24, 2017",
    "title": "How accurate is Tyler Durden's speech on the origin of soap?",
    "content": "In the book(and movie) Tyler goes on an extended monologue about the origin of soap in Indian burial pyres."
  }],
  "answers": [{
      "author": "achilles_m",
      "comment": "The rise of technical intelligentsia can be seem in the USSR from about the 60s, and yes, much of the culture of that period was centered around that class of people — biologists, engineers, scientists, etc.There were two reasons of this. First, it was state-approved after a decade of the space race, the Cold War, the general theme of rebuilding after WWII, getting ahead of the West, etc. The second reason was that the literary culture and the arts couldnt compete for a while because most of the major writers either died in the purges, or in the war, or were spending their time in the camps. There were very few people still writing the good stuff, compared to the -Silver Age- 30 years back. Which created a cultural vacuum of sorts, and it had to be filled."
    }, {
      "author": "aRVAthrowaway",
      "comment": "It actually has been officially recognized as a religion by the United States. The IRS has stated that it is operated exclusively for religious and charitable purposes. And the 9th Circuit Court of Appeals affirmed as much in Headley v. Church of Scientology International."
    }, {
      "author": "Elm11",
      "comment": "Youre all making the same damned joke about the bread getting stale after that long.So yeah, okay, I laughed the first time, but we've had that comment like a dozen times now. Please stop."
    }, {
      "author": "Democracy_Dude",
      "comment": "I'm not a real historian, just a history teacher, but I think I can kind of answer this. When America was first born there was a strong thought among the founding fathers to not go abroad looking for monsters to slay. A major part of their independence relied on them not getting involved with foreign affairs. As part of separating from Europe was separating from their problems as well. Now there were a lot of American citizens that wanted to return the favor to France and fight the British. Especially because Britain had been stirring up trouble with the Native Americans in an effort to destroy the new country and regain the territory back. But it would have been a pointless fight. America didn't have nearly a good enough navy to send troops over to Europe in any meaningful way and it would have just provoked a much more powerful nation to attack them once again."
    }]
}
